DELETE FROM votes;
DELETE FROM daily_menu_detail;
DELETE FROM daily_menu;
DELETE FROM dishes;
DELETE FROM restaurants;
DELETE FROM user_roles;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password) VALUES
('User', 'user@yandex.ru', '{noop}password'),
('Admin', 'admin@gmail.com', '{noop}admin');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_USER', 100000),
  ('ROLE_ADMIN', 100001),
  ('ROLE_USER', 100001);

INSERT INTO restaurants (name) VALUES
  ('Ресторан 1'), -- 100002
  ('Ресторан 2'), -- 100003
  ('Ресторан 3'), -- 100004
  ('Ресторан 4'), -- 100005
  ('Ресторан 5'); -- 100006


INSERT INTO dishes (name, price) VALUES
  ('Салат Оливье', 50.0), -- 100007
  ('Салат Столичный', 40.0),
  ('Салат Цезарь', 90.0),
  ('Стейк', 150.0),
  ('Шашлык', 120.0),
  ('Салат Шефский', 70.0),  -- 100012
  ('Салат Греческий особенный', 80.0),
  ('Стейк от шефа', 140.0),
  ('Шашлык шея', 130.0),
  ('Запеченные овощи', 110.0),
  ('Пицца', 125.0),
  ('Картошка Фри', 40.0),
  ('Картошка запеченная', 45.0),
  ('Стейк с картошкой', 170.0),   -- 100020
  ('Шашлык телятина', 135.0),
  ('Запеченные овощи в тандыре', 70.0),
  ('Курица Гриль', 105.0),
  ('Сэндвич', 50.0),  --100024
  ('Суп Харчо', 60.0),
  ('Салат Шефский обычный', 65.0),
  ('Салат Греческий', 75.0), -- 100027
  ('Красный борщ', 50.0), --
  ('Устрицы', 140.0), --
  ('Кофе американо', 25.0), --
  ('Кофе эспрессо', 30.0), --
  ('Чай черный', 20.0), --
  ('Чай зеленый', 20.0), -- 100033
  ('Пельмени', 80.0), --
  ('Вареники', 60.0), --
  ('Рагу', 75.0); -- 100036


INSERT INTO daily_menu (date, rest_id) VALUES
('2018-11-21', 100002), --100037
('2018-11-21', 100003),
('2018-11-21', 100004),
('2018-11-22', 100002),
('2018-11-22', 100003),
('2018-11-22', 100004),
('2018-11-23', 100002),
('2018-11-23', 100003),
('2018-11-23', 100004); --100045

INSERT INTO daily_menu_detail (daily_menu_id, dish_id) VALUES
(100037, 100007), --100046
(100037, 100008),
(100038, 100009),
(100038, 100010),
(100039, 100011),
(100039, 100012),
(100040, 100013),
(100040, 100014),
(100041, 100015),
(100041, 100016),
(100042, 100017),
(100042, 100018),
(100043, 100019),
(100043, 100020),
(100044, 100021),
(100044, 100022),
(100045, 100023),
(100045, 100024); --100063


/*
INSERT INTO VOTES (DATE, USER_ID, DAILY_MENU_ID, DATE_TIME) VALUES
('2018-11-21 00:00:00',  100000, 100037, CURRENT_TIMESTAMP),--100064
('2018-11-21 00:00:00',  100001, 100038, CURRENT_TIMESTAMP),
('2018-11-22 00:00:00',  100000, 100040, CURRENT_TIMESTAMP),
('2018-11-22 00:00:00',  100001, 100042, CURRENT_TIMESTAMP),
('2018-11-23 00:00:00',  100000, 100044, CURRENT_TIMESTAMP),
('2018-11-23 00:00:00',  100001, 100044, CURRENT_TIMESTAMP);--100069
*/


INSERT INTO VOTES (DATE, USER_ID, REST_ID, DATE_TIME) VALUES
  ('2018-11-21 00:00:00',  100000, 100002, CURRENT_TIMESTAMP),--100064
  ('2018-11-21 00:00:00',  100001, 100003, CURRENT_TIMESTAMP),
  ('2018-11-22 00:00:00',  100000, 100002, CURRENT_TIMESTAMP),
  ('2018-11-22 00:00:00',  100001, 100004, CURRENT_TIMESTAMP),
  ('2018-11-23 00:00:00',  100000, 100003, CURRENT_TIMESTAMP),
  ('2018-11-23 00:00:00',  100001, 100003, CURRENT_TIMESTAMP);--100069

select Generate_DailyMenu((current_date-1), (current_date + 4));

--select GenerateDailyDishes(to_date('01-01-2019','DD-MM-YYYY'), to_date('01-01-2019','DD-MM-YYYY'));

--select GenerateDailyDishes('11.11.2018','15.11.2018');
